shaspitz/orbit-stabilization/ME135_235/SimulatedOutput.cydsn/Generated_Source/PSoC5/ForceInput.h
/*******************************************************************************
* File Name: ForceInput.h  
* Version 1.90
*
* Description:
*  This file containts Status Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_STATUS_REG_ForceInput_H) /* CY_STATUS_REG_ForceInput_H */
#define CY_STATUS_REG_ForceInput_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
    #include "CyLib.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 statusState;

} ForceInput_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

uint8 ForceInput_Read(void) ;
void ForceInput_InterruptEnable(void) ;
void ForceInput_InterruptDisable(void) ;
void ForceInput_WriteMask(uint8 mask) ;
uint8 ForceInput_ReadMask(void) ;


/***************************************
*           API Constants
***************************************/

#define ForceInput_STATUS_INTR_ENBL    0x10u


/***************************************
*         Parameter Constants
***************************************/

/* Status Register Inputs */
#define ForceInput_INPUTS              1


/***************************************
*             Registers
***************************************/

/* Status Register */
#define ForceInput_Status             (* (reg8 *) ForceInput_sts_sts_reg__STATUS_REG )
#define ForceInput_Status_PTR         (  (reg8 *) ForceInput_sts_sts_reg__STATUS_REG )
#define ForceInput_Status_Mask        (* (reg8 *) ForceInput_sts_sts_reg__MASK_REG )
#define ForceInput_Status_Aux_Ctrl    (* (reg8 *) ForceInput_sts_sts_reg__STATUS_AUX_CTL_REG )

#endif /* End CY_STATUS_REG_ForceInput_H */


/* [] END OF FILE */
